src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Comment>Источник, откуда клиент узнал о Барбершопе</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПолученияИнформацииОКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

Перем _КэшТипыКонтрагентов; // Хранит кэш значения Перечисления.ТипыКонтрагентов

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(_)
	установитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(_)
	установитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура установитьВидимостьЭлементовФормы()
	// Реализация метода выполнена с учетом возможности изменений
	// конфигурации / добавления значений в Перечисления.ТипыКонтрагентов
	
	этоКлиент_ = этоКлиент();
	
	Элементы.ДатаРождения.Видимость = этоКлиент_;
	Элементы.Пол.Видимость = этоКлиент_;
	Элементы.Источник.Видимость = этоКлиент_;
	
	этоПоставщик_ = ?(этоКлиент_, Ложь, этоПоставщик());
	Элементы.ОсновнойДоговор.Видимость = этоПоставщик_;
	
	Элементы.Наименование.Заголовок = ?(этоКлиент_, "Ф.И.О. клиента", "Наименование");
КонецПроцедуры

&НаСервере
Функция этоКлиент()
	Возврат Объект.ТипКонтрагента = получитьТипыКонтрагентов().Клиент;
КонецФункции

&НаСервере
Функция этоПоставщик()
	Возврат Объект.ТипКонтрагента = получитьТипыКонтрагентов().Поставщик;
КонецФункции

&НаСервере
Функция получитьТипыКонтрагентов()
	_КэшТипыКонтрагентов = ?(_КэшТипыКонтрагентов <> Неопределено,
			_КэшТипыКонтрагентов, Перечисления.ТипыКонтрагентов);
	Возврат _КэшТипыКонтрагентов;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
